pDriveTest/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale           1;


vertices
(
    (-1 -1 -1)  // 0
    ( 1 -1 -1)  // 1
    ( 1  1 -1)  // 2
    (-1  1 -1)  // 3
    (-1 -1  1)  // 4
    ( 1 -1  1)  // 5
    ( 1  1  1)  // 6
    (-1  1  1)  // 7


);

blocks
(
    hex ( 0 1 2 3 4 5 6 7 ) (100 100 1) simpleGrading (1 1 1)
);



boundary
(
    left
    {
        type patch;
        faces
        (
            ( 0 3 4 7 )
        );
    }
    right
    {
        type patch;
        faces
        (
            ( 1 2 6 5 )
        );
    }
    up
    {
        type patch;
        faces
        (
            ( 2 3 7 6 )
        );
    }
    down
    {
        type patch;
        faces
        (
            ( 0 1 5 4 )
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
